/*
0. Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное на само себя).
*/

Console.WriteLine("Enter number: "); // cw - быстрый выбор Console.WriteLine

int userNumber = Convert.ToInt32(Console.ReadLine());

int result = userNumber * userNumber;

System.Console.WriteLine(result);
System.Console.WriteLine(userNumber * userNumber);